; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image7 - mode
	spectrograph5 - mode
	infrared6 - mode
	image1 - mode
	spectrograph0 - mode
	spectrograph3 - mode
	infrared4 - mode
	image2 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 image7)
	(supports instrument0 infrared4)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet6 spectrograph0)
	(have_image Planet6 image7)
	(have_image Star7 image1)
	(have_image Star7 image7)
	(have_image Planet8 infrared4)
	(have_image Star9 image7)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Planet12 spectrograph5)
	(have_image Phenomenon13 image7)
	(have_image Phenomenon13 image1)
	(have_image Planet14 spectrograph5)
))

)

; plan
1. (turn_to satellite0 groundstation0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 0 of 14
5. (take_image satellite0 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 1 of 14
6. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 1 of 14
7. (take_image satellite0 planet6 instrument1 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 2 of 14
8. (turn_to satellite0 planet12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet12)
   goals met: 2 of 14
9. (take_image satellite0 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 3 of 14
10. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 14
11. (take_image satellite0 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 14
12. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 14
13. (take_image satellite0 phenomenon10 instrument1 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 14
14. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 14
15. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 6 of 14
16. (take_image satellite0 phenomenon11 instrument1 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 7 of 14
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 14
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 14
19. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 7 of 14
20. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 7 of 14
21. (turn_to satellite0 phenomenon13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 14
22. (take_image satellite0 phenomenon13 instrument0 image7)
   added: (have_image phenomenon13 image7)
   goals met: 8 of 14
23. (turn_to satellite0 planet12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet12)
   goals met: 8 of 14
24. (take_image satellite0 planet12 instrument0 spectrograph5)
   added: (have_image planet12 spectrograph5)
   goals met: 9 of 14
25. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 9 of 14
26. (take_image satellite0 planet14 instrument0 spectrograph5)
   added: (have_image planet14 spectrograph5)
   goals met: 10 of 14
27. (turn_to satellite0 planet6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet6)
   goals met: 10 of 14
28. (take_image satellite0 planet6 instrument0 image7)
   added: (have_image planet6 image7)
   goals met: 11 of 14
29. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 11 of 14
30. (take_image satellite0 planet8 instrument0 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 12 of 14
31. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 12 of 14
32. (take_image satellite0 star7 instrument0 image7)
   added: (have_image star7 image7)
   goals met: 13 of 14
33. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 13 of 14
34. (take_image satellite0 star9 instrument0 image7)
   added: (have_image star9 image7)
   goals met: 14 of 14
